config/Documents/ЛистОбратнойСвязиHR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Document>
		<Properties>
			<Name>ЛистОбратнойСвязиHR</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Управляющий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НацДиректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РегионДиректор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Город</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Города</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КолвоБаллов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентСоответствия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Результаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Критерий</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КритерииОбратнойСвязиHR</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кво</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарииПроверяющего</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокУстранения</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗадачаУправляющему</Name>
							<Type>
								<v8:Type>cfg:TaskRef.ЗадачаИсполнителя</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КомментарийИсполнителя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>200</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтметкаОбИсполнении</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыВыполнения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

config/Catalogs/КритерииОбратнойСвязиHR.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Catalog>
		<Properties>
			<Name>КритерииОбратнойСвязиHR</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПолнНаименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>350</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПоПорядку</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

config/Documents/ЛистОбратнойСвязиHR/Ext/ManagerModule.bsl
Процедура Печать(ТабДок, Ссылка) Экспорт
	ДокСсылка = Ссылка[0];
	
	Макет1 = Документы.ЛистОбратнойСвязиHR.ПолучитьМакет("Печать");
	
	Обл = Макет1.ПолучитьОбласть("Шапка");			
	Обл.Параметры.Заполнить(ДокСсылка);
	ТабДок.Вывести(Обл);
	
		
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВложенныйЗапрос.Ссылка,
	               |	ВложенныйЗапрос.Родитель,
	               |	ВложенныйЗапрос.Родитель.Родитель КАК ГлРодитель,
	               |	ВложенныйЗапрос.ЭтоГруппа,
	               |	ВложенныйЗапрос.ПолнНаименование,
	               |	ВЫБОР
	               |		КОГДА ВложенныйЗапрос.НомерПоПорядку > 1000
	               |			ТОГДА ВложенныйЗапрос.НомерПоПорядку
	               |		ИНАЧЕ ВложенныйЗапрос.РодительРодительНомерПоПорядку * 100000 + ВложенныйЗапрос.РодительНомерПоПорядку * 1000 + ВложенныйЗапрос.НомерПоПорядку
	               |	КОНЕЦ КАК ОбщийНомерПоПорядку,
	               |	ВложенныйЗапрос.НомерПоПорядку,
	               |	ВложенныйЗапрос.РодительНомерПоПорядку,
	               |	ВложенныйЗапрос.РодительРодительНомерПоПорядку,
	               |	СУММА(ВложенныйЗапрос.Кво) КАК Кво,
	               |	МАКСИМУМ(ВложенныйЗапрос.КомментарииПроверяющего) КАК КомментарииПроверяющего,
	               |	МАКСИМУМ(ВложенныйЗапрос.СрокУстранения) КАК СрокУстранения,
	               |	МАКСИМУМ(ВложенныйЗапрос.ОтметкаОбИсполнении) КАК ОтметкаОбИсполнении,
	               |	МАКСИМУМ(ВложенныйЗапрос.ЗадачаУправляющемуСсылка) КАК ЗадачаУправляющемуСсылка
	               |ИЗ
	               |	(ВЫБРАТЬ
	               |		КритерииОбратнойСвязиHR.Ссылка КАК Ссылка,
	               |		КритерииОбратнойСвязиHR.Родитель КАК Родитель,
	               |		КритерииОбратнойСвязиHR.ЭтоГруппа КАК ЭтоГруппа,
	               |		КритерииОбратнойСвязиHR.ПолнНаименование КАК ПолнНаименование,
	               |		ВЫБОР
	               |			КОГДА НЕ КритерииОбратнойСвязиHR.ЭтоГруппа
	               |				ТОГДА КритерииОбратнойСвязиHR.НомерПоПорядку
	               |			ИНАЧЕ ВЫБОР
	               |					КОГДА КритерииОбратнойСвязиHR.Родитель.Ссылка ЕСТЬ NULL 
	               |						ТОГДА 100000 * КритерииОбратнойСвязиHR.НомерПоПорядку
	               |					ИНАЧЕ 100000 * КритерииОбратнойСвязиHR.Родитель.НомерПоПорядку + 1000 * КритерииОбратнойСвязиHR.НомерПоПорядку
	               |				КОНЕЦ
	               |		КОНЕЦ КАК НомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА КритерииОбратнойСвязиHR.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ КритерииОбратнойСвязиHR.Родитель.НомерПоПорядку
	               |		КОНЕЦ КАК РодительНомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА КритерииОбратнойСвязиHR.Родитель.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ КритерииОбратнойСвязиHR.Родитель.Родитель.НомерПоПорядку
	               |		КОНЕЦ КАК РодительРодительНомерПоПорядку,
	               |		0 КАК Кво,
	               |		"""" КАК КомментарииПроверяющего,
	               |		&ПустДата КАК СрокУстранения,
	               |		ЛОЖЬ КАК ОтметкаОбИсполнении,
	               |		0 КАК ЗадачаУправляющемуСсылка
	               |	ИЗ
	               |		Справочник.КритерииОбратнойСвязиHR КАК КритерииОбратнойСвязиHR
	               |	ГДЕ
	               |		НЕ КритерииОбратнойСвязиHR.ПометкаУдаления
	               |	
	               |	ОБЪЕДИНИТЬ
	               |	
	               |	ВЫБРАТЬ
	               |		ЛистОбратнойСвязиHRРезультаты.Критерий,
	               |		ЛистОбратнойСвязиHRРезультаты.Критерий.Родитель,
	               |		ЛистОбратнойСвязиHRРезультаты.Критерий.ЭтоГруппа,
	               |		ЛистОбратнойСвязиHRРезультаты.Критерий.ПолнНаименование,
	               |		ЛистОбратнойСвязиHRРезультаты.Критерий.НомерПоПорядку,
	               |		ВЫБОР
	               |			КОГДА ЛистОбратнойСвязиHRРезультаты.Критерий.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ ЛистОбратнойСвязиHRРезультаты.Критерий.Родитель.НомерПоПорядку
	               |		КОНЕЦ,
	               |		ВЫБОР
	               |			КОГДА ЛистОбратнойСвязиHRРезультаты.Критерий.Родитель.Родитель.Ссылка ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ ЛистОбратнойСвязиHRРезультаты.Критерий.Родитель.Родитель.НомерПоПорядку
	               |		КОНЕЦ,
	               |		ЛистОбратнойСвязиHRРезультаты.Кво,
	               |		ЛистОбратнойСвязиHRРезультаты.КомментарииПроверяющего,
	               |		ЛистОбратнойСвязиHRРезультаты.СрокУстранения,
	               |		ЛистОбратнойСвязиHRРезультаты.ОтметкаОбИсполнении,
	               |		ВЫБОР
	               |			КОГДА ЛистОбратнойСвязиHRРезультаты.ЗадачаУправляющему ЕСТЬ NULL 
	               |				ТОГДА 0
	               |			ИНАЧЕ ЛистОбратнойСвязиHRРезультаты.ЗадачаУправляющему
	               |		КОНЕЦ
	               |	ИЗ
	               |		Документ.ЛистОбратнойСвязиHR.Результаты КАК ЛистОбратнойСвязиHRРезультаты
	               |	ГДЕ
	               |		ЛистОбратнойСвязиHRРезультаты.Ссылка = &ВыбДокумент) КАК ВложенныйЗапрос
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВложенныйЗапрос.Ссылка,
	               |	ВложенныйЗапрос.Родитель,
	               |	ВложенныйЗапрос.ЭтоГруппа,
	               |	ВложенныйЗапрос.ПолнНаименование,
	               |	ВложенныйЗапрос.НомерПоПорядку,
	               |	ВложенныйЗапрос.РодительНомерПоПорядку,
	               |	ВложенныйЗапрос.РодительРодительНомерПоПорядку,
	               |	ВложенныйЗапрос.Родитель.Родитель
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ОбщийНомерПоПорядку";
				   
				   
	Запрос.УстановитьПараметр("ВыбДокумент", ДокСсылка);
	Запрос.УстановитьПараметр("ПустДата", Дата(2010,1,1));

	
	тз = Запрос.Выполнить().Выгрузить();
	//тз.Сортировать("РодительРодительНомерПоПорядку, РодительНомерПоПорядку, НомерПоПорядку");
	
	Нпп = 0;
	Для Каждого стр из тз цикл
		Если стр.ЭтоГруппа тогда
			Если ЗначениеЗаполнено(стр.Родитель) тогда  // подгруппа
				
				ПараметрыОтбора = Новый Структура("Родитель",стр.Ссылка);
				МассивСтрок = тз.НайтиСтроки(ПараметрыОтбора);
				СуммаГруппы = 0;
				Для Каждого эл Из МассивСтрок Цикл
					СуммаГруппы = СуммаГруппы + эл.Кво;
				КонецЦикла;
	
				Обл = Макет1.ПолучитьОбласть("Группа");
				Обл.Параметры.СтрГруппа = стр.ПолнНаименование;
				Обл.Параметры.Родитель = стр.Родитель;
				Обл.Параметры.БалГруппа = СуммаГруппы;
				ТабДок.Вывести(Обл);

			иначе  // раздел
				
				ПараметрыОтбора = Новый Структура("ГлРодитель",стр.Ссылка);
				МассивСтрок = тз.НайтиСтроки(ПараметрыОтбора);
				СуммаРаздела = 0;
				Для Каждого эл Из МассивСтрок Цикл
					СуммаРаздела = СуммаРаздела + эл.Кво;
				КонецЦикла;
				
				Обл = Макет1.ПолучитьОбласть("Раздел");
				Обл.Параметры.СтрРаздел = стр.ПолнНаименование;
				Обл.Параметры.Родитель = "Сам";
				Обл.Параметры.БалРаздел = СуммаРаздела;
				ТабДок.Вывести(Обл);

			КонецЕсли;
			
		иначе // строка
			
			Нпп = Нпп + 1;
		

			Обл = Макет1.ПолучитьОбласть("Строка");
			Обл.Параметры.Нпп = Нпп;
			Обл.Параметры.СтрНаим = стр.ПолнНаименование;
			Обл.Параметры.ТекКритерий = стр.Ссылка;
			Обл.Параметры.СтрБал = стр.Кво;					
			Обл.Параметры.СтрКоммент = стр.КомментарииПроверяющего;
			Обл.Параметры.Родитель = стр.Родитель;

			Если стр.СрокУстранения <> Дата(2010,1,1) тогда
				Обл.Параметры.СтрДат = стр.СрокУстранения;
			КонецЕсли;
			ТабДок.Вывести(Обл);
			ТабДок.Область("R"+ТабДок.ВысотаТаблицы+"C3").Формат = "ЧН=0";
		КонецЕсли;

	КонецЦикла;
	
	КолвоКритериев = Нпп;
	ОблПодвал = Макет1.ПолучитьОбласть("Подвал");
	ТабДок.Вывести(ОблПодвал);
	ОблПусто = Макет1.ПолучитьОбласть("Пусто");
	ТабДок.Вывести(ОблПусто);
КонецПроцедуры
